nxp-mcuxpresso/mcux-soc-svd/KW47B42Z83/KW47B42Z83_cm33_core0.xml
        <register>
          <name>LCL_GPIO_CTRL0</name>
          <description>LCL GPIO CTRL 0</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUT_0</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_1</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_2</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_3</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_4</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_5</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_6</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_7</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_GPIO_CTRL1</name>
          <description>LCL GPIO CTRL 1</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUT_8</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_9</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_10</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_11</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_12</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_13</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_14</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_15</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_GPIO_CTRL2</name>
          <description>LCL GPIO CTRL 2</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUT_16</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_17</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_18</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_19</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_20</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_21</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_22</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_23</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_GPIO_CTRL3</name>
          <description>LCL GPIO CTRL 3</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUT_24</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_25</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_26</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_27</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_28</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_29</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_30</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT_31</name>
              <description>GPIO antenna state LUT entry</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_GPIO_CTRL4</name>
          <description>LCL GPIO CTRL 4</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUT_WRAP_PTR</name>
              <description>Wrap point for the LUT table in generating the 4 antenna GPIO wire states.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_DMA_MASK_DELAY</name>
          <description>LCL_DMA_MASK_DELAY</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_MASK_DELAY_OFF</name>
              <description>DMA_MASK_DELAY_OFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_MASK_DELAY</name>
              <description>DMA_MASK_DELAY</description>
              <bitOffset>8</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_DMA_MASK_PERIOD</name>
          <description>LCL_DMA_MASK_PERIOD</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_MASK_REF_PER</name>
              <description>DMA_MASK_REF_PER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_CSR</name>
          <description>Ranging Sequence Manager Control and Status</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_COEX_ABORT_ST</name>
              <description>RSM COEX ABORT STATUS</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_PLL_ABORT</name>
              <description>RSM PLL ABORT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_UNDR_ERR</name>
              <description>RSM UNDERRUN ERROR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_OVF_ERR</name>
              <description>RSM OVERFLOW ERROR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_TIMEOUT0_ABORT</name>
              <description>RSM_TIMEOUT0_ABORT</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_TIME_ALIGN</name>
              <description>RSM_TIME_ALIGN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_STATE</name>
              <description>RSM_STATE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_STATE_0</name>
                  <description>IDLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_1</name>
                  <description>DELAY. Used only for the trigger delay in SQTE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_2</name>
                  <description>EXT_TX (Extend TX). Used only for PDE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_3</name>
                  <description>EXT_RX (Extend RX). Used only for PDE</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_4</name>
                  <description>WU (Warmup). Used only for SQTE</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_5</name>
                  <description>DT_TX (Packet TX). Used only for SQTE</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_6</name>
                  <description>DT_RX (Packet RX). Used only for SQTE</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_7</name>
                  <description>DT_RX_SYNC (Packet RX Sync). Used only for SQTE</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_8</name>
                  <description>FM_TX (Frequency Measurement TX). Used only for SQTE</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_9</name>
                  <description>FM_RX (Frequency Measurement RX). Used only for SQTE</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_10</name>
                  <description>PM_TX (Phase Measurement TX).</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_11</name>
                  <description>PM_RX (Phase Measurement RX).</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_12</name>
                  <description>IP1_RX2TX (Interlude Period 1 RX2TX). Used only for SQTE</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_13</name>
                  <description>IP1_TX2RX (Interlude Period 1 TX2RX). Used only for SQTE</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_14</name>
                  <description>S_RX2RX (Short Period RX2RX). Used only for SQTE</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_15</name>
                  <description>S_TX2TX (Short Period TX2TX). Used only for SQTE</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_16</name>
                  <description>IP2_RX2TX (Interlude Period 2 RX2TX).</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_17</name>
                  <description>IP2_TX2RX (Interlude Period 2 TX2RX).</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_18</name>
                  <description>FC_RX2TX (Frequency Change RX2TX).</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_19</name>
                  <description>FC_TX2RX (Frequency Change TX2RX).</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_20</name>
                  <description>WD (Warmdown)</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_22</name>
                  <description>TX_OFF</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_STATE_23</name>
                  <description>RX_OFF</description>
                  <value>0x17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSM_STEP_FORMAT</name>
              <description>RSM_STEP_FORMAT</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_CURRENT_STEPS</name>
              <description>RSM_CURRENT_STEPS</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
